In [3]:
import pandas as pd

#### Reading Excel Files

In [35]:
excel_file = pd.ExcelFile(r"C:\Users\91912\pandas datasets\employees.xlsx")        # 
excel_file.sheet_names

['Employee Info', 'Employee Salary', 'Employee Projects']

#### Reading Particular Sheets

In [39]:
df_excel1 = pd.read_excel(r"C:\Users\91912\pandas datasets\employees.xlsx",sheet_name = 0)   # here accessing sheets using sheet index
df_excel1

    ID           Name   Department
0  101       John Doe           HR
1  102     Jane Smith  Engineering
2  103    Emily Davis        Sales
3  104  Michael Brown    Marketing

#### Reading Multiple Sheets

In [5]:
df = pd.read_excel(r"C:\Users\91912\OneDrive\Documents\Book1.xlsx",sheet_name = [0,1],)
# Gives a dictionary with keys as sheet_name and values as dataframes

In [7]:
df

{0:   Name  age
 0   p1   21
 1   p2   20
 2   p3   22
 3   p4   24,
 1:    math  english
 0    32       30
 1    32       30
 2    32       30
 3    32       30}

In [9]:
df[0]

  Name  age
0   p1   21
1   p2   20
2   p3   22
3   p4   24

In [11]:
df[1]

   math  english
0    32       30
1    32       30
2    32       30
3    32       30

#### Writing Data to Excel Files

In [13]:
# with to_excel we can covert single dataframe to excel sheet at a time

In [15]:
with pd.ExcelWriter(r"C:\Users\91912\OneDrive\Documents\Book2.xlsx") as f:
    df[0].to_excel(f,sheet_name = "Student_info")
    df[1].to_excel(f,sheet_name = "sem_1")